In [2]:
import pandas as pd

In [3]:
df=pd.read_excel(r"C:\Users\asus\Desktop\Datasets\Raw data .xlsx")
df

    Id      Name  Lastname  Salary Department  Mobile no.
0    1     Anshu    Rajput   90000      Sales  8595787610
1    2    Manish     Kumar   62000  Marketing  8595787611
2    3     Aadil      Khan   70000    Finance  8595787612
3    4   Chandan    Thakur   80000         IT  8595787613
4    5      Aman     Anand   20000      Sales  8595787614
5    6     Badal     Singh   65000  Marketing  8595787615
6    7      Anil     Yadav   55000    Finance  8595787616
7    8     Akash     Verma   75000         IT  8595787617
8    9      Yash  Kushwaha   25000      Sales  8595787618
9   10  Abhishek     Yadav   95000  Marketing  8595787619
10  11   Aaditya     Yadav   10000    Finance  8595787620
11  12     Daksh   Chauhan   66000         IT  8595787621
12  13     Ayush     Singh   30000      Sales  8595787622
13  14      Arun     Singh   89000  Marketing  8595787623
14  15    Ashish     Rawat   90000    Finance  8595787624
15  16    Shivam    Thakur   91000         IT  8595787625
16  17     Swati    Thakur   92000      Sales  8595787626
17  18    Vineet      Ojha   93000  Marketing  8595787627
18  19    Sourav    Mathur   94000    Finance  8595787628
19  20    Yogesh    Sharma   95000         IT  8595787629

In [4]:
df['Taxsalary']=df['Salary']*0.8
df

    Id      Name  Lastname  Salary Department  Mobile no.  Taxsalary
0    1     Anshu    Rajput   90000      Sales  8595787610    72000.0
1    2    Manish     Kumar   62000  Marketing  8595787611    49600.0
2    3     Aadil      Khan   70000    Finance  8595787612    56000.0
3    4   Chandan    Thakur   80000         IT  8595787613    64000.0
4    5      Aman     Anand   20000      Sales  8595787614    16000.0
5    6     Badal     Singh   65000  Marketing  8595787615    52000.0
6    7      Anil     Yadav   55000    Finance  8595787616    44000.0
7    8     Akash     Verma   75000         IT  8595787617    60000.0
8    9      Yash  Kushwaha   25000      Sales  8595787618    20000.0
9   10  Abhishek     Yadav   95000  Marketing  8595787619    76000.0
10  11   Aaditya     Yadav   10000    Finance  8595787620     8000.0
11  12     Daksh   Chauhan   66000         IT  8595787621    52800.0
12  13     Ayush     Singh   30000      Sales  8595787622    24000.0
13  14      Arun     Singh   89000  Marketing  8595787623    71200.0
14  15    Ashish     Rawat   90000    Finance  8595787624    72000.0
15  16    Shivam    Thakur   91000         IT  8595787625    72800.0
16  17     Swati    Thakur   92000      Sales  8595787626    73600.0
17  18    Vineet      Ojha   93000  Marketing  8595787627    74400.0
18  19    Sourav    Mathur   94000    Finance  8595787628    75200.0
19  20    Yogesh    Sharma   95000         IT  8595787629    76000.0

In [5]:
one=pd.DataFrame({
    'id':[1,2,3,4,5],
    'Name':['Akash','Anshu','Aadil','Badal','Chandan'],
    'subject_id':['sub1','sub2','sub3','sub4','sub5']})
one

   id     Name subject_id
0   1    Akash       sub1
1   2    Anshu       sub2
2   3    Aadil       sub3
3   4    Badal       sub4
4   5  Chandan       sub5

In [6]:
two=pd.DataFrame({
    'id':[1,2,3,14,15],
    'Name':['Anil','Aditya','Aadil','Bhupesh','Deepak'],
    'subject_id':['sub1','sub2','sub3','sub4','sub5']})
two

   id     Name subject_id
0   1     Anil       sub1
1   2   Aditya       sub2
2   3    Aadil       sub3
3  14  Bhupesh       sub4
4  15   Deepak       sub5

In [7]:
# joins in pandas
# Left join  (It can show the full left side data and compair with right side data.)
# Right join  (It can show the full right side data and compair with left side data.)
# Inner join  (It can show the common data in both left and right side data.)
# Outer join  (It can show the overall compairsion of left or right both side data at a time.)

In [8]:
# By default is apply inner join.
print(pd.merge(one,two,on='id'))

   id Name_x subject_id_x  Name_y subject_id_y
0   1  Akash         sub1    Anil         sub1
1   2  Anshu         sub2  Aditya         sub2
2   3  Aadil         sub3   Aadil         sub3

In [9]:
print(pd.merge(one,two,on='Name',how='left'))

   id_x     Name subject_id_x  id_y subject_id_y
0     1    Akash         sub1   NaN          NaN
1     2    Anshu         sub2   NaN          NaN
2     3    Aadil         sub3   3.0         sub3
3     4    Badal         sub4   NaN          NaN
4     5  Chandan         sub5   NaN          NaN

In [10]:
print(pd.merge(one,two,on='id',how='right'))

   id Name_x subject_id_x   Name_y subject_id_y
0   1  Akash         sub1     Anil         sub1
1   2  Anshu         sub2   Aditya         sub2
2   3  Aadil         sub3    Aadil         sub3
3  14    NaN          NaN  Bhupesh         sub4
4  15    NaN          NaN   Deepak         sub5

In [11]:
print(pd.merge(one,two,on='id',how='inner'))

   id Name_x subject_id_x  Name_y subject_id_y
0   1  Akash         sub1    Anil         sub1
1   2  Anshu         sub2  Aditya         sub2
2   3  Aadil         sub3   Aadil         sub3

In [12]:
print(pd.merge(one,two,on='id',how='outer'))

   id   Name_x subject_id_x   Name_y subject_id_y
0   1    Akash         sub1     Anil         sub1
1   2    Anshu         sub2   Aditya         sub2
2   3    Aadil         sub3    Aadil         sub3
3   4    Badal         sub4      NaN          NaN
4   5  Chandan         sub5      NaN          NaN
5  14      NaN          NaN  Bhupesh         sub4
6  15      NaN          NaN   Deepak         sub5

In [13]:
# apply these join methods behalf of two coloumns.
print(pd.merge(one,two,on=['id','Name']))

   id   Name subject_id_x subject_id_y
0   3  Aadil         sub3         sub3

In [14]:
print(pd.merge(one,two,on=['id','Name'],how='outer'))

   id     Name subject_id_x subject_id_y
0   1    Akash         sub1          NaN
1   1     Anil          NaN         sub1
2   2   Aditya          NaN         sub2
3   2    Anshu         sub2          NaN
4   3    Aadil         sub3         sub3
5   4    Badal         sub4          NaN
6   5  Chandan         sub5          NaN
7  14  Bhupesh          NaN         sub4
8  15   Deepak          NaN         sub5

In [15]:
# Group by: A groupby operation involves some combination of splitting the object, applying a function, and combining the results. 
#           This can be used to group large amounts of data and compute operations on these groups. 
#            Parameters: bymapping, function, label, pd.Grouper or list of such. Used to determine the groups for the groupby.

In [16]:
df

    Id      Name  Lastname  Salary Department  Mobile no.  Taxsalary
0    1     Anshu    Rajput   90000      Sales  8595787610    72000.0
1    2    Manish     Kumar   62000  Marketing  8595787611    49600.0
2    3     Aadil      Khan   70000    Finance  8595787612    56000.0
3    4   Chandan    Thakur   80000         IT  8595787613    64000.0
4    5      Aman     Anand   20000      Sales  8595787614    16000.0
5    6     Badal     Singh   65000  Marketing  8595787615    52000.0
6    7      Anil     Yadav   55000    Finance  8595787616    44000.0
7    8     Akash     Verma   75000         IT  8595787617    60000.0
8    9      Yash  Kushwaha   25000      Sales  8595787618    20000.0
9   10  Abhishek     Yadav   95000  Marketing  8595787619    76000.0
10  11   Aaditya     Yadav   10000    Finance  8595787620     8000.0
11  12     Daksh   Chauhan   66000         IT  8595787621    52800.0
12  13     Ayush     Singh   30000      Sales  8595787622    24000.0
13  14      Arun     Singh   89000  Marketing  8595787623    71200.0
14  15    Ashish     Rawat   90000    Finance  8595787624    72000.0
15  16    Shivam    Thakur   91000         IT  8595787625    72800.0
16  17     Swati    Thakur   92000      Sales  8595787626    73600.0
17  18    Vineet      Ojha   93000  Marketing  8595787627    74400.0
18  19    Sourav    Mathur   94000    Finance  8595787628    75200.0
19  20    Yogesh    Sharma   95000         IT  8595787629    76000.0

In [17]:
h=df.groupby('Department')
h

In [18]:
for i,j in h:
    print(i)
    print(j)

Finance
    Id     Name Lastname  Salary Department  Mobile no.  Taxsalary
2    3    Aadil     Khan   70000    Finance  8595787612    56000.0
6    7     Anil    Yadav   55000    Finance  8595787616    44000.0
10  11  Aaditya    Yadav   10000    Finance  8595787620     8000.0
14  15   Ashish    Rawat   90000    Finance  8595787624    72000.0
18  19   Sourav   Mathur   94000    Finance  8595787628    75200.0
IT
    Id     Name Lastname  Salary Department  Mobile no.  Taxsalary
3    4  Chandan   Thakur   80000         IT  8595787613    64000.0
7    8    Akash    Verma   75000         IT  8595787617    60000.0
11  12    Daksh  Chauhan   66000         IT  8595787621    52800.0
15  16   Shivam   Thakur   91000         IT  8595787625    72800.0
19  20   Yogesh   Sharma   95000         IT  8595787629    76000.0
Marketing
    Id      Name Lastname  Salary Department  Mobile no.  Taxsalary
1    2    Manish    Kumar   62000  Marketing  8595787611    49600.0
5    6     Badal    Singh   65000  Marketing  8595787615    52000.0
9   10  Abhishek    Yadav   95000  Marketing  8595787619    76000.0
13  14      Arun    Singh   89000  Marketing  8595787623    71200.0
17  18    Vineet     Ojha   93000  Marketing  8595787627    74400.0
Sales
    Id   Name  Lastname  Salary Department  Mobile no.  Taxsalary
0    1  Anshu    Rajput   90000      Sales  8595787610    72000.0
4    5   Aman     Anand   20000      Sales  8595787614    16000.0
8    9   Yash  Kushwaha   25000      Sales  8595787618    20000.0
12  13  Ayush     Singh   30000      Sales  8595787622    24000.0
16  17  Swati    Thakur   92000      Sales  8595787626    73600.0

In [19]:
b=h['Salary'].sum()
b

Department
Finance      319000
IT           407000
Marketing    404000
Sales        257000
Name: Salary, dtype: int64

In [20]:
type(b)

pandas.core.series.Series

In [21]:
# Now we can change this data type in dataframe for performing the pandas methods.
k=pd.DataFrame(b)
k

            Salary
Department
Finance     319000
IT          407000
Marketing   404000
Sales       257000

In [22]:
k.sort_values('Salary',ascending=False)

            Salary
Department
IT          407000
Marketing   404000
Finance     319000
Sales       257000

In [23]:
# Highest salary find by dapartment wise.but at this point there is a situation 
# when two or more department can have same values then the data can be only once,so we can use another method to achieve this. 
k.sort_values('Salary',ascending=False).head(1)

            Salary
Department
IT          407000

In [24]:
k[k.Salary==k['Salary'].max()]

            Salary
Department
IT          407000

In [25]:
# Now Group by also perform behalf of two columns.
h2=df.groupby(['Department','Lastname'])
h2

In [26]:
for i,j in h2:
    print(i)
    print(j)

('Finance', 'Khan')
   Id   Name Lastname  Salary Department  Mobile no.  Taxsalary
2   3  Aadil     Khan   70000    Finance  8595787612    56000.0
('Finance', 'Mathur')
    Id    Name Lastname  Salary Department  Mobile no.  Taxsalary
18  19  Sourav   Mathur   94000    Finance  8595787628    75200.0
('Finance', 'Rawat')
    Id    Name Lastname  Salary Department  Mobile no.  Taxsalary
14  15  Ashish    Rawat   90000    Finance  8595787624    72000.0
('Finance', 'Yadav')
    Id     Name Lastname  Salary Department  Mobile no.  Taxsalary
6    7     Anil    Yadav   55000    Finance  8595787616    44000.0
10  11  Aaditya    Yadav   10000    Finance  8595787620     8000.0
('IT', 'Chauhan')
    Id   Name Lastname  Salary Department  Mobile no.  Taxsalary
11  12  Daksh  Chauhan   66000         IT  8595787621    52800.0
('IT', 'Sharma')
    Id    Name Lastname  Salary Department  Mobile no.  Taxsalary
19  20  Yogesh   Sharma   95000         IT  8595787629    76000.0
('IT', 'Thakur')
    Id     Name Lastname  Salary Department  Mobile no.  Taxsalary
3    4  Chandan   Thakur   80000         IT  8595787613    64000.0
15  16   Shivam   Thakur   91000         IT  8595787625    72800.0
('IT', 'Verma')
   Id   Name Lastname  Salary Department  Mobile no.  Taxsalary
7   8  Akash    Verma   75000         IT  8595787617    60000.0
('Marketing', 'Kumar')
   Id    Name Lastname  Salary Department  Mobile no.  Taxsalary
1   2  Manish    Kumar   62000  Marketing  8595787611    49600.0
('Marketing', 'Ojha')
    Id    Name Lastname  Salary Department  Mobile no.  Taxsalary
17  18  Vineet     Ojha   93000  Marketing  8595787627    74400.0
('Marketing', 'Singh')
    Id   Name Lastname  Salary Department  Mobile no.  Taxsalary
5    6  Badal    Singh   65000  Marketing  8595787615    52000.0
13  14   Arun    Singh   89000  Marketing  8595787623    71200.0
('Marketing', 'Yadav')
   Id      Name Lastname  Salary Department  Mobile no.  Taxsalary
9  10  Abhishek    Yadav   95000  Marketing  8595787619    76000.0
('Sales', 'Anand')
   Id  Name Lastname  Salary Department  Mobile no.  Taxsalary
4   5  Aman    Anand   20000      Sales  8595787614    16000.0
('Sales', 'Kushwaha')
   Id  Name  Lastname  Salary Department  Mobile no.  Taxsalary
8   9  Yash  Kushwaha   25000      Sales  8595787618    20000.0
('Sales', 'Rajput')
   Id   Name Lastname  Salary Department  Mobile no.  Taxsalary
0   1  Anshu   Rajput   90000      Sales  8595787610    72000.0
('Sales', 'Singh')
    Id   Name Lastname  Salary Department  Mobile no.  Taxsalary
12  13  Ayush    Singh   30000      Sales  8595787622    24000.0
('Sales', 'Thakur')
    Id   Name Lastname  Salary Department  Mobile no.  Taxsalary
16  17  Swati   Thakur   92000      Sales  8595787626    73600.0

In [27]:
h2['Salary'].count()

Department  Lastname
Finance     Khan        1
            Mathur      1
            Rawat       1
            Yadav       2
IT          Chauhan     1
            Sharma      1
            Thakur      2
            Verma       1
Marketing   Kumar       1
            Ojha        1
            Singh       2
            Yadav       1
Sales       Anand       1
            Kushwaha    1
            Rajput      1
            Singh       1
            Thakur      1
Name: Salary, dtype: int64

In [28]:
h=df.groupby('Department')
h

In [29]:
k=pd.DataFrame(b)
k

            Salary
Department
Finance     319000
IT          407000
Marketing   404000
Sales       257000

In [30]:
k[k['Salary']>200000]

            Salary
Department
Finance     319000
IT          407000
Marketing   404000
Sales       257000

In [31]:
k[(k['Salary']>200000)&(k['Salary']<300000)]

            Salary
Department
Sales       257000

In [32]:
p=h['Salary'].count()
p

Department
Finance      5
IT           5
Marketing    5
Sales        5
Name: Salary, dtype: int64

In [33]:
m=pd.DataFrame(p)
m

            Salary
Department
Finance          5
IT               5
Marketing        5
Sales            5

In [34]:
t=pd.concat([k,m],axis=1)
t

            Salary  Salary
Department
Finance     319000       5
IT          407000       5
Marketing   404000       5
Sales       257000       5

In [35]:
df[['Department','Salary']].pivot_table(index='Department')

             Salary
Department
Finance     63800.0
IT          81400.0
Marketing   80800.0
Sales       51400.0

In [36]:
pd.set_option('display.max_column',None)
df[['Department','Salary','Taxsalary','Lastname']].pivot_table(index='Department',columns='Lastname')

             Salary                                                        \
Lastname      Anand  Chauhan     Khan    Kumar Kushwaha   Mathur     Ojha
Department
Finance         NaN      NaN  70000.0      NaN      NaN  94000.0      NaN
IT              NaN  66000.0      NaN      NaN      NaN      NaN      NaN
Marketing       NaN      NaN      NaN  62000.0      NaN      NaN  93000.0
Sales       20000.0      NaN      NaN      NaN  25000.0      NaN      NaN

                                                                           \
Lastname     Rajput    Rawat   Sharma    Singh   Thakur    Verma    Yadav
Department
Finance         NaN  90000.0      NaN      NaN      NaN      NaN  32500.0
IT              NaN      NaN  95000.0      NaN  85500.0  75000.0      NaN
Marketing       NaN      NaN      NaN  77000.0      NaN      NaN  95000.0
Sales       90000.0      NaN      NaN  30000.0  92000.0      NaN      NaN

           Taxsalary                                                        \
Lastname       Anand  Chauhan     Khan    Kumar Kushwaha   Mathur     Ojha
Department
Finance          NaN      NaN  56000.0      NaN      NaN  75200.0      NaN
IT               NaN  52800.0      NaN      NaN      NaN      NaN      NaN
Marketing        NaN      NaN      NaN  49600.0      NaN      NaN  74400.0
Sales        16000.0      NaN      NaN      NaN  20000.0      NaN      NaN


Lastname     Rajput    Rawat   Sharma    Singh   Thakur    Verma    Yadav
Department
Finance         NaN  72000.0      NaN      NaN      NaN      NaN  26000.0
IT              NaN      NaN  76000.0      NaN  68400.0  60000.0      NaN
Marketing       NaN      NaN      NaN  61600.0      NaN      NaN  76000.0
Sales       72000.0      NaN      NaN  24000.0  73600.0      NaN      NaN

In [37]:
# For remove the NaN and print 0 with that place.
pd.set_option('display.max_column',None)
df[['Department','Salary','Taxsalary','Lastname']].pivot_table(index='Department',columns='Lastname',fill_value=0,aggfunc='count')

           Salary                                                              \
Lastname    Anand Chauhan Khan Kumar Kushwaha Mathur Ojha Rajput Rawat Sharma
Department
Finance         0       0    1     0        0      1    0      0     1      0
IT              0       1    0     0        0      0    0      0     0      1
Marketing       0       0    0     1        0      0    1      0     0      0
Sales           1       0    0     0        1      0    0      1     0      0

                                    Taxsalary                              \
Lastname   Singh Thakur Verma Yadav     Anand Chauhan Khan Kumar Kushwaha
Department
Finance        0      0     0     2         0       0    1     0        0
IT             0      2     1     0         0       1    0     0        0
Marketing      2      0     0     1         0       0    0     1        0
Sales          1      1     0     0         1       0    0     0        1


Lastname   Mathur Ojha Rajput Rawat Sharma Singh Thakur Verma Yadav
Department
Finance         1    0      0     1      0     0      0     0     2
IT              0    0      0     0      1     0      2     1     0
Marketing       0    1      0     0      0     2      0     0     1
Sales           0    0      1     0      0     1      1     0     0

In [38]:
# For maximum salary of different department.
df[['Department','Salary','Taxsalary',]].pivot_table(index='Department',fill_value=0,aggfunc='max')

            Salary  Taxsalary
Department
Finance      94000    75200.0
IT           95000    76000.0
Marketing    95000    76000.0
Sales        92000    73600.0

In [39]:
# for print the sum of total rows and columns.
df[['Department','Salary','Taxsalary',]].pivot_table(index='Department',fill_value=0,aggfunc='sum',margins=True)

             Salary  Taxsalary
Department
Finance      319000   255200.0
IT           407000   325600.0
Marketing    404000   323200.0
Sales        257000   205600.0
All         1387000  1109600.0

In [40]:
import numpy as np

In [41]:
ipl_data = {'Team':['Riders','Riders','Devils','Devils','Kings','Kings','Kings','Kings','Riders','Royals','Royals','Royals'],
            'Rank':[1,2,2,3,3,4,1,1,2,4,1,2],
            'Year':[2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
            'Points':[876,789,863,673,741,812,756,788,694,701,884,690]}
df2= pd.DataFrame(ipl_data)
df2

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     884
11  Royals     2  2017     690

In [42]:
df2.pivot_table(index='Team',columns='Year',aggfunc='sum',fill_value=0,margins=True)

       Points                         Rank
Year     2014  2015  2016  2017   All 2014 2015 2016 2017 All
Team
Devils    863   673     0     0  1536    2    3    0    0   5
Kings     741   812   756   788  3097    3    4    1    1   9
Riders    876   789   694     0  2359    1    2    2    0   5
Royals    701   884     0   690  2275    4    1    0    2   7
All      3181  3158  1450  1478  9267   10   10    3    3  26

In [44]:
pd.set_option('display.max_column',None)
df[['Department','Salary','Taxsalary','Lastname']].pivot_table(index='Department',columns='Lastname',fill_value=0,aggfunc='sum',margins=True)

             Salary                                                        \
Lastname      Anand  Chauhan     Khan    Kumar Kushwaha   Mathur     Ojha
Department
Finance         0.0      0.0  70000.0      0.0      0.0  94000.0      0.0
IT              0.0  66000.0      0.0      0.0      0.0      0.0      0.0
Marketing       0.0      0.0      0.0  62000.0      0.0      0.0  93000.0
Sales       20000.0      0.0      0.0      0.0  25000.0      0.0      0.0
All         20000.0  66000.0  70000.0  62000.0  25000.0  94000.0  93000.0

                                                                              \
Lastname     Rajput    Rawat   Sharma     Singh    Thakur    Verma     Yadav
Department
Finance         0.0  90000.0      0.0       0.0       0.0      0.0   65000.0
IT              0.0      0.0  95000.0       0.0  171000.0  75000.0       0.0
Marketing       0.0      0.0      0.0  154000.0       0.0      0.0   95000.0
Sales       90000.0      0.0      0.0   30000.0   92000.0      0.0       0.0
All         90000.0  90000.0  95000.0  184000.0  263000.0  75000.0  160000.0

                    Taxsalary                                               \
Lastname        All     Anand  Chauhan     Khan    Kumar Kushwaha   Mathur
Department
Finance      319000       0.0      0.0  56000.0      0.0      0.0  75200.0
IT           407000       0.0  52800.0      0.0      0.0      0.0      0.0
Marketing    404000       0.0      0.0      0.0  49600.0      0.0      0.0
Sales        257000   16000.0      0.0      0.0      0.0  20000.0      0.0
All         1387000   16000.0  52800.0  56000.0  49600.0  20000.0  75200.0

                                                                             \
Lastname       Ojha   Rajput    Rawat   Sharma     Singh    Thakur    Verma
Department
Finance         0.0      0.0  72000.0      0.0       0.0       0.0      0.0
IT              0.0      0.0      0.0  76000.0       0.0  136800.0  60000.0
Marketing   74400.0      0.0      0.0      0.0  123200.0       0.0      0.0
Sales           0.0  72000.0      0.0      0.0   24000.0   73600.0      0.0
All         74400.0  72000.0  72000.0  76000.0  147200.0  210400.0  60000.0


Lastname       Yadav        All
Department
Finance      52000.0   255200.0
IT               0.0   325600.0
Marketing    76000.0   323200.0
Sales            0.0   205600.0
All         128000.0  1109600.0

In [45]:
# heandling misssing values in dataset.

In [1]:
#-----------------------------
#  Data Cleaning 
#-----------------------------

In [22]:
import numpy as np
import pandas as pd

In [23]:
s=np.array([4,3,4,5,np.nan,66,55,44,np.nan])
s

array([ 4.,  3.,  4.,  5., nan, 66., 55., 44., nan])

In [24]:
np.sum(s)

np.float64(nan)

In [25]:
df2=pd.read_excel(r"C:\Users\asus\Desktop\Datasets\DATA12.xlsx")
df2

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth,Salary
0,1.0,Lamtone,IT Services,2009.0,"$11,757,018","6,482,465 Dollars",5274553.0,0.30,NaN
1,2.0,Stripfind,Financial Services,2010.0,"$12,329,371","916,455 Dollars",11412916.0,NaN,NaN
2,3.0,Canecorporation,Health,2012.0,"$10,597,009",NaN,3005820.0,NaN,NaN
3,4.0,NaN,IT Services,2013.0,NaN,"7,429,377 Dollars",6597557.0,NaN,NaN
4,5.0,NaN,NaN,NaN,NaN,"7,435,363 Dollars",3138627.0,NaN,NaN
5,6.0,Techline,Health,2006.0,NaN,"5,470,303 Dollars",8427816.0,0.23,NaN
6,7.0,Cityace,NaN,2010.0,"$9,254,614",NaN,3005116.0,0.06,NaN
7,8.0,Kayelectronics,NaN,2009.0,"$9,451,943","3,878,113 Dollars",5573830.0,0.04,NaN
8,9.0,Ganzlax,IT Services,2011.0,"$14,001,180",NaN,11901180.0,0.18,NaN
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [26]:
df2.shape

(10, 9)

In [27]:
df2.isnull().sum()

ID            1
Name          3
Industry      4
Inception     2
Revenue       4
Expenses      4
Profit        1
Growth        5
Salary       10
dtype: int64

In [28]:
df2.drop(['Salary'],axis=1,inplace=True)
df2

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009.0,"$11,757,018","6,482,465 Dollars",5274553.0,0.30
1,2.0,Stripfind,Financial Services,2010.0,"$12,329,371","916,455 Dollars",11412916.0,NaN
2,3.0,Canecorporation,Health,2012.0,"$10,597,009",NaN,3005820.0,NaN
3,4.0,NaN,IT Services,2013.0,NaN,"7,429,377 Dollars",6597557.0,NaN
4,5.0,NaN,NaN,NaN,NaN,"7,435,363 Dollars",3138627.0,NaN
5,6.0,Techline,Health,2006.0,NaN,"5,470,303 Dollars",8427816.0,0.23
6,7.0,Cityace,NaN,2010.0,"$9,254,614",NaN,3005116.0,0.06
7,8.0,Kayelectronics,NaN,2009.0,"$9,451,943","3,878,113 Dollars",5573830.0,0.04
8,9.0,Ganzlax,IT Services,2011.0,"$14,001,180",NaN,11901180.0,0.18
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [29]:
df2.dropna(how='all',inplace=True)
df2

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009.0,"$11,757,018","6,482,465 Dollars",5274553.0,0.30
1,2.0,Stripfind,Financial Services,2010.0,"$12,329,371","916,455 Dollars",11412916.0,NaN
2,3.0,Canecorporation,Health,2012.0,"$10,597,009",NaN,3005820.0,NaN
3,4.0,NaN,IT Services,2013.0,NaN,"7,429,377 Dollars",6597557.0,NaN
4,5.0,NaN,NaN,NaN,NaN,"7,435,363 Dollars",3138627.0,NaN
5,6.0,Techline,Health,2006.0,NaN,"5,470,303 Dollars",8427816.0,0.23
6,7.0,Cityace,NaN,2010.0,"$9,254,614",NaN,3005116.0,0.06
7,8.0,Kayelectronics,NaN,2009.0,"$9,451,943","3,878,113 Dollars",5573830.0,0.04
8,9.0,Ganzlax,IT Services,2011.0,"$14,001,180",NaN,11901180.0,0.18

In [30]:
df2.isnull().sum()/len(df2)    # for check the NaN value percentage in every column.

ID           0.000000
Name         0.222222
Industry     0.333333
Inception    0.111111
Revenue      0.333333
Expenses     0.333333
Profit       0.000000
Growth       0.444444
dtype: float64

In [31]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 0 to 8
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID         9 non-null      float64
 1   Name       7 non-null      object
 2   Industry   6 non-null      object
 3   Inception  8 non-null      float64
 4   Revenue    6 non-null      object
 5   Expenses   6 non-null      object
 6   Profit     9 non-null      float64
 7   Growth     5 non-null      float64
dtypes: float64(4), object(4)
memory usage: 648.0+ bytes

In [32]:
s=df2['Revenue']
s

0    $11,757,018
1    $12,329,371
2    $10,597,009
3             NaN
4             NaN
5             NaN
6     $9,254,614
7     $9,451,943
8    $14,001,180
Name: Revenue, dtype: object

In [33]:
df2['Revenue']=df2['Revenue'].fillna('0')
df2

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009.0,"$11,757,018","6,482,465 Dollars",5274553.0,0.30
1,2.0,Stripfind,Financial Services,2010.0,"$12,329,371","916,455 Dollars",11412916.0,NaN
2,3.0,Canecorporation,Health,2012.0,"$10,597,009",NaN,3005820.0,NaN
3,4.0,NaN,IT Services,2013.0,0,"7,429,377 Dollars",6597557.0,NaN
4,5.0,NaN,NaN,NaN,0,"7,435,363 Dollars",3138627.0,NaN
5,6.0,Techline,Health,2006.0,0,"5,470,303 Dollars",8427816.0,0.23
6,7.0,Cityace,NaN,2010.0,"$9,254,614",NaN,3005116.0,0.06
7,8.0,Kayelectronics,NaN,2009.0,"$9,451,943","3,878,113 Dollars",5573830.0,0.04
8,9.0,Ganzlax,IT Services,2011.0,"$14,001,180",NaN,11901180.0,0.18

In [34]:
p=df2['Revenue']
p

0    $11,757,018
1    $12,329,371
2    $10,597,009
3               0
4               0
5               0
6     $9,254,614
7     $9,451,943
8    $14,001,180
Name: Revenue, dtype: object

In [35]:
r=[]
for i in p:
    s=""
    for j in i:
        if(j.isdigit()):
            s=s+j
    r.append(s)
r

['11757018',
 '12329371',
 '10597009',
 '0',
 '0',
 '0',
 '9254614',
 '9451943',
 '14001180']

In [36]:
df2['Revenue']=r
df2

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009.0,11757018,"6,482,465 Dollars",5274553.0,0.30
1,2.0,Stripfind,Financial Services,2010.0,12329371,"916,455 Dollars",11412916.0,NaN
2,3.0,Canecorporation,Health,2012.0,10597009,NaN,3005820.0,NaN
3,4.0,NaN,IT Services,2013.0,0,"7,429,377 Dollars",6597557.0,NaN
4,5.0,NaN,NaN,NaN,0,"7,435,363 Dollars",3138627.0,NaN
5,6.0,Techline,Health,2006.0,0,"5,470,303 Dollars",8427816.0,0.23
6,7.0,Cityace,NaN,2010.0,9254614,NaN,3005116.0,0.06
7,8.0,Kayelectronics,NaN,2009.0,9451943,"3,878,113 Dollars",5573830.0,0.04
8,9.0,Ganzlax,IT Services,2011.0,14001180,NaN,11901180.0,0.18

In [37]:
df2['Revenue']=df2['Revenue'].astype('int')

In [38]:
df2

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009.0,11757018,"6,482,465 Dollars",5274553.0,0.30
1,2.0,Stripfind,Financial Services,2010.0,12329371,"916,455 Dollars",11412916.0,NaN
2,3.0,Canecorporation,Health,2012.0,10597009,NaN,3005820.0,NaN
3,4.0,NaN,IT Services,2013.0,0,"7,429,377 Dollars",6597557.0,NaN
4,5.0,NaN,NaN,NaN,0,"7,435,363 Dollars",3138627.0,NaN
5,6.0,Techline,Health,2006.0,0,"5,470,303 Dollars",8427816.0,0.23
6,7.0,Cityace,NaN,2010.0,9254614,NaN,3005116.0,0.06
7,8.0,Kayelectronics,NaN,2009.0,9451943,"3,878,113 Dollars",5573830.0,0.04
8,9.0,Ganzlax,IT Services,2011.0,14001180,NaN,11901180.0,0.18

In [39]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 0 to 8
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID         9 non-null      float64
 1   Name       7 non-null      object
 2   Industry   6 non-null      object
 3   Inception  8 non-null      float64
 4   Revenue    9 non-null      int64
 5   Expenses   6 non-null      object
 6   Profit     9 non-null      float64
 7   Growth     5 non-null      float64
dtypes: float64(4), int64(1), object(3)
memory usage: 648.0+ bytes

In [40]:
s=df2['Expenses']
s

0    6,482,465 Dollars
1      916,455 Dollars
2                  NaN
3    7,429,377 Dollars
4    7,435,363 Dollars
5    5,470,303 Dollars
6                  NaN
7    3,878,113 Dollars
8                  NaN
Name: Expenses, dtype: object

In [41]:
df2['Expenses']=df2['Expenses'].fillna('0')
df2

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009.0,11757018,"6,482,465 Dollars",5274553.0,0.30
1,2.0,Stripfind,Financial Services,2010.0,12329371,"916,455 Dollars",11412916.0,NaN
2,3.0,Canecorporation,Health,2012.0,10597009,0,3005820.0,NaN
3,4.0,NaN,IT Services,2013.0,0,"7,429,377 Dollars",6597557.0,NaN
4,5.0,NaN,NaN,NaN,0,"7,435,363 Dollars",3138627.0,NaN
5,6.0,Techline,Health,2006.0,0,"5,470,303 Dollars",8427816.0,0.23
6,7.0,Cityace,NaN,2010.0,9254614,0,3005116.0,0.06
7,8.0,Kayelectronics,NaN,2009.0,9451943,"3,878,113 Dollars",5573830.0,0.04
8,9.0,Ganzlax,IT Services,2011.0,14001180,0,11901180.0,0.18

In [42]:
p=df2['Expenses']
p

0    6,482,465 Dollars
1      916,455 Dollars
2                    0
3    7,429,377 Dollars
4    7,435,363 Dollars
5    5,470,303 Dollars
6                    0
7    3,878,113 Dollars
8                    0
Name: Expenses, dtype: object

In [43]:
r=[]
for i in p:
    s=""
    for j in i:
        if(j.isdigit()):
            s=s+j
    r.append(s)
r

['6482465',
 '916455',
 '0',
 '7429377',
 '7435363',
 '5470303',
 '0',
 '3878113',
 '0']

In [44]:
df2['Expenses']=r
df2

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009.0,11757018,6482465,5274553.0,0.30
1,2.0,Stripfind,Financial Services,2010.0,12329371,916455,11412916.0,NaN
2,3.0,Canecorporation,Health,2012.0,10597009,0,3005820.0,NaN
3,4.0,NaN,IT Services,2013.0,0,7429377,6597557.0,NaN
4,5.0,NaN,NaN,NaN,0,7435363,3138627.0,NaN
5,6.0,Techline,Health,2006.0,0,5470303,8427816.0,0.23
6,7.0,Cityace,NaN,2010.0,9254614,0,3005116.0,0.06
7,8.0,Kayelectronics,NaN,2009.0,9451943,3878113,5573830.0,0.04
8,9.0,Ganzlax,IT Services,2011.0,14001180,0,11901180.0,0.18

In [45]:
df2['Expenses']=df2['Expenses'].astype('int')
df2

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009.0,11757018,6482465,5274553.0,0.30
1,2.0,Stripfind,Financial Services,2010.0,12329371,916455,11412916.0,NaN
2,3.0,Canecorporation,Health,2012.0,10597009,0,3005820.0,NaN
3,4.0,NaN,IT Services,2013.0,0,7429377,6597557.0,NaN
4,5.0,NaN,NaN,NaN,0,7435363,3138627.0,NaN
5,6.0,Techline,Health,2006.0,0,5470303,8427816.0,0.23
6,7.0,Cityace,NaN,2010.0,9254614,0,3005116.0,0.06
7,8.0,Kayelectronics,NaN,2009.0,9451943,3878113,5573830.0,0.04
8,9.0,Ganzlax,IT Services,2011.0,14001180,0,11901180.0,0.18

In [46]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 0 to 8
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID         9 non-null      float64
 1   Name       7 non-null      object
 2   Industry   6 non-null      object
 3   Inception  8 non-null      float64
 4   Revenue    9 non-null      int64
 5   Expenses   9 non-null      int64
 6   Profit     9 non-null      float64
 7   Growth     5 non-null      float64
dtypes: float64(4), int64(2), object(2)
memory usage: 648.0+ bytes

In [47]:
df2['Revenue'].replace(0,np.nan)

0    11757018.0
1    12329371.0
2    10597009.0
3           NaN
4           NaN
5           NaN
6     9254614.0
7     9451943.0
8    14001180.0
Name: Revenue, dtype: float64

In [48]:
df2['Revenue'].replace(0,np.nan,inplace=True)
df2

C:\Users\asus\AppData\Local\Temp\ipykernel_19776\867901241.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df2['Revenue'].replace(0,np.nan,inplace=True)

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009.0,11757018.0,6482465,5274553.0,0.30
1,2.0,Stripfind,Financial Services,2010.0,12329371.0,916455,11412916.0,NaN
2,3.0,Canecorporation,Health,2012.0,10597009.0,0,3005820.0,NaN
3,4.0,NaN,IT Services,2013.0,NaN,7429377,6597557.0,NaN
4,5.0,NaN,NaN,NaN,NaN,7435363,3138627.0,NaN
5,6.0,Techline,Health,2006.0,NaN,5470303,8427816.0,0.23
6,7.0,Cityace,NaN,2010.0,9254614.0,0,3005116.0,0.06
7,8.0,Kayelectronics,NaN,2009.0,9451943.0,3878113,5573830.0,0.04
8,9.0,Ganzlax,IT Services,2011.0,14001180.0,0,11901180.0,0.18

In [49]:
df2['Expenses'].replace(0,np.nan)

0    6482465.0
1     916455.0
2          NaN
3    7429377.0
4    7435363.0
5    5470303.0
6          NaN
7    3878113.0
8          NaN
Name: Expenses, dtype: float64

In [50]:
df2['Expenses'].replace(0,np.nan,inplace=True)
df2

C:\Users\asus\AppData\Local\Temp\ipykernel_19776\2209632761.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df2['Expenses'].replace(0,np.nan,inplace=True)

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009.0,11757018.0,6482465.0,5274553.0,0.30
1,2.0,Stripfind,Financial Services,2010.0,12329371.0,916455.0,11412916.0,NaN
2,3.0,Canecorporation,Health,2012.0,10597009.0,NaN,3005820.0,NaN
3,4.0,NaN,IT Services,2013.0,NaN,7429377.0,6597557.0,NaN
4,5.0,NaN,NaN,NaN,NaN,7435363.0,3138627.0,NaN
5,6.0,Techline,Health,2006.0,NaN,5470303.0,8427816.0,0.23
6,7.0,Cityace,NaN,2010.0,9254614.0,NaN,3005116.0,0.06
7,8.0,Kayelectronics,NaN,2009.0,9451943.0,3878113.0,5573830.0,0.04
8,9.0,Ganzlax,IT Services,2011.0,14001180.0,NaN,11901180.0,0.18

In [51]:
df2.select_dtypes(['object'])

              Name            Industry
0          Lamtone         IT Services
1        Stripfind  Financial Services
2  Canecorporation              Health
3              NaN         IT Services
4              NaN                 NaN
5         Techline              Health
6          Cityace                 NaN
7   Kayelectronics                 NaN
8          Ganzlax         IT Services

In [52]:
df2[['Name','Industry']]=df2[['Name','Industry']].fillna('Unknown')

In [53]:
df2

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009.0,11757018.0,6482465.0,5274553.0,0.30
1,2.0,Stripfind,Financial Services,2010.0,12329371.0,916455.0,11412916.0,NaN
2,3.0,Canecorporation,Health,2012.0,10597009.0,NaN,3005820.0,NaN
3,4.0,Unknown,IT Services,2013.0,NaN,7429377.0,6597557.0,NaN
4,5.0,Unknown,Unknown,NaN,NaN,7435363.0,3138627.0,NaN
5,6.0,Techline,Health,2006.0,NaN,5470303.0,8427816.0,0.23
6,7.0,Cityace,Unknown,2010.0,9254614.0,NaN,3005116.0,0.06
7,8.0,Kayelectronics,Unknown,2009.0,9451943.0,3878113.0,5573830.0,0.04
8,9.0,Ganzlax,IT Services,2011.0,14001180.0,NaN,11901180.0,0.18

In [55]:
df2['Inception']. value_counts()

Inception
2009.0    2
2010.0    2
2012.0    1
2013.0    1
2006.0    1
2011.0    1
Name: count, dtype: int64

In [56]:
df2['Inception'].fillna(df2['Inception'].mode()[0])

0    2009.0
1    2010.0
2    2012.0
3    2013.0
4    2009.0
5    2006.0
6    2010.0
7    2009.0
8    2011.0
Name: Inception, dtype: float64

In [58]:
df2['Inception'].fillna(df2['Inception'].mode()[0],inplace=True)
df2

C:\Users\asus\AppData\Local\Temp\ipykernel_19776\2275341852.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df2['Inception'].fillna(df2['Inception'].mode()[0],inplace=True)

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009.0,11757018.0,6482465.0,5274553.0,0.30
1,2.0,Stripfind,Financial Services,2010.0,12329371.0,916455.0,11412916.0,NaN
2,3.0,Canecorporation,Health,2012.0,10597009.0,NaN,3005820.0,NaN
3,4.0,Unknown,IT Services,2013.0,NaN,7429377.0,6597557.0,NaN
4,5.0,Unknown,Unknown,2009.0,NaN,7435363.0,3138627.0,NaN
5,6.0,Techline,Health,2006.0,NaN,5470303.0,8427816.0,0.23
6,7.0,Cityace,Unknown,2010.0,9254614.0,NaN,3005116.0,0.06
7,8.0,Kayelectronics,Unknown,2009.0,9451943.0,3878113.0,5573830.0,0.04
8,9.0,Ganzlax,IT Services,2011.0,14001180.0,NaN,11901180.0,0.18

In [60]:
df2['Revenue'].fillna(df2['Expenses']+df2['Profit'],inplace=True)

C:\Users\asus\AppData\Local\Temp\ipykernel_19776\424169260.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df2['Revenue'].fillna(df2['Expenses']+df2['Profit'],inplace=True)

In [61]:
df2

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009.0,11757018.0,6482465.0,5274553.0,0.30
1,2.0,Stripfind,Financial Services,2010.0,12329371.0,916455.0,11412916.0,NaN
2,3.0,Canecorporation,Health,2012.0,10597009.0,NaN,3005820.0,NaN
3,4.0,Unknown,IT Services,2013.0,14026934.0,7429377.0,6597557.0,NaN
4,5.0,Unknown,Unknown,2009.0,10573990.0,7435363.0,3138627.0,NaN
5,6.0,Techline,Health,2006.0,13898119.0,5470303.0,8427816.0,0.23
6,7.0,Cityace,Unknown,2010.0,9254614.0,NaN,3005116.0,0.06
7,8.0,Kayelectronics,Unknown,2009.0,9451943.0,3878113.0,5573830.0,0.04
8,9.0,Ganzlax,IT Services,2011.0,14001180.0,NaN,11901180.0,0.18